---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.FreeSize
source: html/ede00c8f-3d08-3949-1994-a16ed40ea79d.htm
---
# Autodesk.Revit.DB.FabricationPart.FreeSize Property

The inner size of the fabrication part.

## Syntax (C#)
```csharp
public string FreeSize { get; }
```